EA/src/Documents/УстановкаУчетныхЦенКонтрактов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>УстановкаУчетныхЦенКонтрактов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УчетныеЦеныНоменклатурыКонтрактов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДержательКонтракта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДержателиКонтракта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контракт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контракты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

EA/src/InformationRegisters/УчетныеЦеныНоменклатурыКонтрактов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>УчетныеЦеныНоменклатурыКонтрактов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контракт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контракты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

EA/src/Documents/УстановкаУчетныхЦенКонтрактов/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Контракт") Тогда
		
		ДержательКонтракта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения.Контракт, "Владелец");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УстановкаУчетныхЦенКонтрактовТовары.Ссылка.Дата     КАК Период,
	|	УстановкаУчетныхЦенКонтрактовТовары.Ссылка          КАК Регистратор,
	|	УстановкаУчетныхЦенКонтрактовТовары.НомерСтроки     КАК НомерСтроки,
	|	УстановкаУчетныхЦенКонтрактовТовары.Номенклатура    КАК Номенклатура,
	|	УстановкаУчетныхЦенКонтрактовТовары.Ссылка.Контракт КАК Контракт,
	|	УстановкаУчетныхЦенКонтрактовТовары.Цена            КАК Цена
	|ИЗ
	|	Документ.УстановкаУчетныхЦенКонтрактов.Товары КАК УстановкаУчетныхЦенКонтрактовТовары
	|ГДЕ
	|	УстановкаУчетныхЦенКонтрактовТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение = Движения.УчетныеЦеныНоменклатурыКонтрактов.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
	КонецЦикла;
	
	Движения.УчетныеЦеныНоменклатурыКонтрактов.Записать();
	
КонецПроцедуры

#КонецОбласти
